; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-8-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-3 - location
	p1-4 - location
	p2-0 - location
	p2-1 - location
	p3-5 - location
	p5-1 - location
	p5-4 - location
	p5-6 - location
	p6-0 - location
	p6-2 - location
	p6-4 - location
	p6-5 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s5)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s5)
	(empty truck7)
	(at truck8 s4)
	(empty truck8)
	(at package1 s6)
	(at package2 s0)
	(at package3 s3)
	(at package4 s0)
	(at package5 s3)
	(at package6 s6)
	(at package7 s4)
	(at package8 s3)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 87)
	(= (time-to-walk p1-3 s1) 87)
	(= (time-to-walk s3 p1-3) 82)
	(= (time-to-walk p1-3 s3) 82)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 57)
	(= (time-to-walk p1-4 s1) 57)
	(= (time-to-walk s4 p1-4) 90)
	(= (time-to-walk p1-4 s4) 90)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 53)
	(= (time-to-walk p2-0 s2) 53)
	(= (time-to-walk s0 p2-0) 72)
	(= (time-to-walk p2-0 s0) 72)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 41)
	(= (time-to-walk p2-1 s2) 41)
	(= (time-to-walk s1 p2-1) 50)
	(= (time-to-walk p2-1 s1) 50)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 39)
	(= (time-to-walk p3-5 s3) 39)
	(= (time-to-walk s5 p3-5) 24)
	(= (time-to-walk p3-5 s5) 24)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 52)
	(= (time-to-walk p5-1 s5) 52)
	(= (time-to-walk s1 p5-1) 28)
	(= (time-to-walk p5-1 s1) 28)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 86)
	(= (time-to-walk p5-4 s5) 86)
	(= (time-to-walk s4 p5-4) 9)
	(= (time-to-walk p5-4 s4) 9)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(= (time-to-walk s5 p5-6) 40)
	(= (time-to-walk p5-6 s5) 40)
	(= (time-to-walk s6 p5-6) 78)
	(= (time-to-walk p5-6 s6) 78)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(= (time-to-walk s6 p6-0) 10)
	(= (time-to-walk p6-0 s6) 10)
	(= (time-to-walk s0 p6-0) 74)
	(= (time-to-walk p6-0 s0) 74)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 40)
	(= (time-to-walk p6-2 s6) 40)
	(= (time-to-walk s2 p6-2) 60)
	(= (time-to-walk p6-2 s2) 60)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 58)
	(= (time-to-walk p6-4 s6) 58)
	(= (time-to-walk s4 p6-4) 69)
	(= (time-to-walk p6-4 s4) 69)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 55)
	(= (time-to-drive s1 s0) 55)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 8)
	(= (time-to-drive s2 s0) 8)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 42)
	(= (time-to-drive s5 s0) 42)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 13)
	(= (time-to-drive s6 s0) 13)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 63)
	(= (time-to-drive s6 s1) 63)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 56)
	(= (time-to-drive s0 s3) 56)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 69)
	(= (time-to-drive s1 s3) 69)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 72)
	(= (time-to-drive s5 s3) 72)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 2)
	(= (time-to-drive s6 s3) 2)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 56)
	(= (time-to-drive s1 s5) 56)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 54)
	(= (time-to-drive s4 s5) 54)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 58)
	(= (time-to-drive s2 s6) 58)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 46)
	(= (time-to-drive s4 s6) 46)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s5)
	(at driver5 s5)
	(at truck1 s2)
	(at truck2 s4)
	(at truck3 s4)
	(at truck4 s3)
	(at truck5 s2)
	(at truck6 s2)
	(at truck8 s1)
	(at package1 s4)
	(at package2 s6)
	(at package3 s0)
	(at package4 s2)
	(at package5 s5)
	(at package6 s3)
	(at package7 s3)
	(at package8 s0)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 2  (driven))) (* 4  (walked))))

)

; plan
1. (walk driver2 s5 p5-4)
   deleted: (at driver2 s5)
   added: (at driver2 p5-4)
   changed: (walked) from 0 to 86
   goals met: 0 of 17
2. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 0 of 17
3. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 0 of 17
4. (load-truck package2 truck5 s0)
   deleted: (at package2 s0)
   added: (in package2 truck5)
   goals met: 0 of 17
5. (load-truck package5 truck3 s3)
   deleted: (at package5 s3)
   added: (in package5 truck3)
   goals met: 0 of 17
6. (disembark-truck driver4 truck3 s3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 0 of 17
7. (walk driver2 p5-4 s4)
   deleted: (at driver2 p5-4)
   added: (at driver2 s4)
   changed: (walked) from 86 to 95
   goals met: 0 of 17
8. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 0 of 17
9. (load-truck package3 truck3 s3)
   deleted: (at package3 s3)
   added: (in package3 truck3)
   goals met: 0 of 17
10. (load-truck package4 truck5 s0)
   deleted: (at package4 s0)
   added: (in package4 truck5)
   goals met: 0 of 17
11. (drive-truck truck5 s0 s6 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   changed: (driven) from 0 to 13
   goals met: 0 of 17
12. (load-truck package6 truck5 s6)
   deleted: (at package6 s6)
   added: (in package6 truck5)
   goals met: 0 of 17
13. (load-truck package8 truck3 s3)
   deleted: (at package8 s3)
   added: (in package8 truck3)
   goals met: 0 of 17
14. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 0 of 17
15. (load-truck package1 truck5 s6)
   deleted: (at package1 s6)
   added: (in package1 truck5)
   goals met: 0 of 17
16. (drive-truck truck5 s6 s3 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   changed: (driven) from 13 to 15
   goals met: 0 of 17
17. (load-truck package7 truck4 s4)
   deleted: (at package7 s4)
   added: (in package7 truck4)
   goals met: 0 of 17
18. (unload-truck package6 truck5 s3)
   deleted: (in package6 truck5)
   added: (at package6 s3)
   goals met: 1 of 17
19. (drive-truck truck5 s3 s6 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s6)
   changed: (driven) from 15 to 17
   goals met: 1 of 17
20. (drive-truck truck5 s6 s2 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   changed: (driven) from 17 to 75
   goals met: 2 of 17
21. (board-truck driver4 truck3 s3)
   deleted: (at driver4 s3) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 2 of 17
22. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 2 of 17
23. (walk driver5 s1 p5-1)
   deleted: (at driver5 s1)
   added: (at driver5 p5-1)
   changed: (walked) from 95 to 123
   goals met: 2 of 17
24. (walk driver1 s6 p6-4)
   deleted: (at driver1 s6)
   added: (at driver1 p6-4)
   changed: (walked) from 123 to 181
   goals met: 2 of 17
25. (unload-truck package4 truck5 s2)
   deleted: (in package4 truck5)
   added: (at package4 s2)
   goals met: 3 of 17
26. (walk driver5 p5-1 s1)
   deleted: (at driver5 p5-1)
   added: (at driver5 s1)
   changed: (walked) from 181 to 209
   goals met: 3 of 17
27. (walk driver1 p6-4 s4)
   deleted: (at driver1 p6-4)
   added: (at driver1 s4)
   changed: (walked) from 209 to 278
   goals met: 3 of 17
28. (drive-truck truck4 s4 s5 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s5)
   changed: (driven) from 75 to 129
   goals met: 3 of 17
29. (board-truck driver1 truck8 s4)
   deleted: (at driver1 s4) (empty truck8)
   added: (driving driver1 truck8)
   goals met: 3 of 17
30. (drive-truck truck8 s4 s5 driver1)
   deleted: (at truck8 s4)
   added: (at truck8 s5)
   changed: (driven) from 129 to 183
   goals met: 3 of 17
31. (drive-truck truck8 s5 s1 driver1)
   deleted: (at truck8 s5)
   added: (at truck8 s1)
   changed: (driven) from 183 to 239
   goals met: 4 of 17
32. (drive-truck truck4 s5 s3 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s3)
   changed: (driven) from 239 to 311
   goals met: 5 of 17
33. (drive-truck truck3 s3 s5 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   changed: (driven) from 311 to 383
   goals met: 5 of 17
34. (unload-truck package5 truck3 s5)
   deleted: (in package5 truck3)
   added: (at package5 s5)
   goals met: 6 of 17
35. (unload-truck package7 truck4 s3)
   deleted: (in package7 truck4)
   added: (at package7 s3)
   goals met: 7 of 17
36. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 7 of 17
37. (disembark-truck driver1 truck8 s1)
   deleted: (driving driver1 truck8)
   added: (at driver1 s1) (empty truck8)
   goals met: 7 of 17
38. (board-truck driver5 truck2 s1)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 7 of 17
39. (drive-truck truck2 s1 s5 driver5)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 383 to 439
   goals met: 7 of 17
40. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 7 of 17
41. (drive-truck truck1 s1 s6 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   changed: (driven) from 439 to 502
   goals met: 7 of 17
42. (drive-truck truck1 s6 s2 driver1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 502 to 560
   goals met: 8 of 17
43. (board-truck driver2 truck6 s3)
   deleted: (at driver2 s3) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 8 of 17
44. (drive-truck truck6 s3 s5 driver2)
   deleted: (at truck6 s3)
   added: (at truck6 s5)
   changed: (driven) from 560 to 632
   goals met: 8 of 17
45. (drive-truck truck5 s2 s6 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s6)
   changed: (driven) from 632 to 690
   goals met: 7 of 17
46. (unload-truck package2 truck5 s6)
   deleted: (in package2 truck5)
   added: (at package2 s6)
   goals met: 8 of 17
47. (drive-truck truck5 s6 s4 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s4)
   changed: (driven) from 690 to 736
   goals met: 8 of 17
48. (unload-truck package1 truck5 s4)
   deleted: (in package1 truck5)
   added: (at package1 s4)
   goals met: 9 of 17
49. (drive-truck truck5 s4 s6 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s6)
   changed: (driven) from 736 to 782
   goals met: 9 of 17
50. (drive-truck truck5 s6 s2 driver3)
   deleted: (at truck5 s6)
   added: (at truck5 s2)
   changed: (driven) from 782 to 840
   goals met: 10 of 17
51. (drive-truck truck3 s5 s0 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   changed: (driven) from 840 to 882
   goals met: 10 of 17
52. (unload-truck package3 truck3 s0)
   deleted: (in package3 truck3)
   added: (at package3 s0)
   goals met: 11 of 17
53. (unload-truck package8 truck3 s0)
   deleted: (in package8 truck3)
   added: (at package8 s0)
   goals met: 12 of 17
54. (drive-truck truck3 s0 s5 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (driven) from 882 to 924
   goals met: 12 of 17
55. (drive-truck truck2 s5 s4 driver5)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 924 to 978
   goals met: 13 of 17
56. (disembark-truck driver2 truck6 s5)
   deleted: (driving driver2 truck6)
   added: (at driver2 s5) (empty truck6)
   goals met: 14 of 17
57. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 14 of 17
58. (board-truck driver2 truck6 s5)
   deleted: (at driver2 s5) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 13 of 17
59. (drive-truck truck2 s4 s5 driver5)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   changed: (driven) from 978 to 1032
   goals met: 12 of 17
60. (disembark-truck driver5 truck2 s5)
   deleted: (driving driver5 truck2)
   added: (at driver5 s5) (empty truck2)
   goals met: 13 of 17
61. (board-truck driver4 truck2 s5)
   deleted: (at driver4 s5) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 13 of 17
62. (drive-truck truck2 s5 s4 driver4)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   changed: (driven) from 1032 to 1086
   goals met: 14 of 17
63. (drive-truck truck6 s5 s0 driver2)
   deleted: (at truck6 s5)
   added: (at truck6 s0)
   changed: (driven) from 1086 to 1128
   goals met: 14 of 17
64. (drive-truck truck6 s0 s2 driver2)
   deleted: (at truck6 s0)
   added: (at truck6 s2)
   changed: (driven) from 1128 to 1136
   goals met: 15 of 17
65. (disembark-truck driver2 truck6 s2)
   deleted: (driving driver2 truck6)
   added: (at driver2 s2) (empty truck6)
   goals met: 15 of 17
66. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 1136 to 1144
   goals met: 14 of 17
67. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 14 of 17
68. (drive-truck truck1 s0 s5 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (driven) from 1144 to 1186
   goals met: 14 of 17
69. (walk driver2 s2 p2-1)
   deleted: (at driver2 s2)
   added: (at driver2 p2-1)
   changed: (walked) from 278 to 319
   goals met: 14 of 17
70. (drive-truck truck1 s5 s0 driver1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   changed: (driven) from 1186 to 1228
   goals met: 14 of 17
71. (board-truck driver5 truck3 s5)
   deleted: (at driver5 s5) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 13 of 17
72. (drive-truck truck3 s5 s1 driver5)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (driven) from 1228 to 1284
   goals met: 13 of 17
73. (walk driver2 p2-1 s1)
   deleted: (at driver2 p2-1)
   added: (at driver2 s1)
   changed: (walked) from 319 to 369
   goals met: 13 of 17
74. (walk driver2 s1 p5-1)
   deleted: (at driver2 s1)
   added: (at driver2 p5-1)
   changed: (walked) from 369 to 397
   goals met: 13 of 17
75. (walk driver2 p5-1 s5)
   deleted: (at driver2 p5-1)
   added: (at driver2 s5)
   changed: (walked) from 397 to 449
   goals met: 14 of 17
76. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 1284 to 1292
   goals met: 15 of 17
77. (drive-truck truck3 s1 s6 driver5)
   deleted: (at truck3 s1)
   added: (at truck3 s6)
   changed: (driven) from 1292 to 1355
   goals met: 15 of 17
78. (disembark-truck driver5 truck3 s6)
   deleted: (driving driver5 truck3)
   added: (at driver5 s6) (empty truck3)
   goals met: 15 of 17
79. (walk driver5 s6 p5-6)
   deleted: (at driver5 s6)
   added: (at driver5 p5-6)
   changed: (walked) from 449 to 527
   goals met: 15 of 17
80. (walk driver5 p5-6 s5)
   deleted: (at driver5 p5-6)
   added: (at driver5 s5)
   changed: (walked) from 527 to 567
   goals met: 16 of 17
81. (drive-truck truck2 s4 s6 driver4)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 1355 to 1401
   goals met: 15 of 17
82. (disembark-truck driver4 truck2 s6)
   deleted: (driving driver4 truck2)
   added: (at driver4 s6) (empty truck2)
   goals met: 15 of 17
83. (board-truck driver4 truck3 s6)
   deleted: (at driver4 s6) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 15 of 17
84. (drive-truck truck3 s6 s4 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 1401 to 1447
   goals met: 16 of 17
85. (drive-truck truck1 s2 s6 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 1447 to 1505
   goals met: 15 of 17
86. (disembark-truck driver1 truck1 s6)
   deleted: (driving driver1 truck1)
   added: (at driver1 s6) (empty truck1)
   goals met: 15 of 17
87. (board-truck driver1 truck2 s6)
   deleted: (at driver1 s6) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 15 of 17
88. (drive-truck truck2 s6 s4 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (driven) from 1505 to 1551
   goals met: 16 of 17
89. (drive-truck truck3 s4 s6 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (driven) from 1551 to 1597
   goals met: 15 of 17
90. (disembark-truck driver4 truck3 s6)
   deleted: (driving driver4 truck3)
   added: (at driver4 s6) (empty truck3)
   goals met: 15 of 17
91. (board-truck driver4 truck1 s6)
   deleted: (at driver4 s6) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 15 of 17
92. (drive-truck truck1 s6 s2 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   changed: (driven) from 1597 to 1655
   goals met: 16 of 17
93. (drive-truck truck2 s4 s6 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 1655 to 1701
   goals met: 15 of 17
94. (disembark-truck driver1 truck2 s6)
   deleted: (driving driver1 truck2)
   added: (at driver1 s6) (empty truck2)
   goals met: 15 of 17
95. (board-truck driver1 truck3 s6)
   deleted: (at driver1 s6) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 17
96. (drive-truck truck3 s6 s4 driver1)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 1701 to 1747
   goals met: 16 of 17
97. (walk driver3 s2 p6-2)
   deleted: (at driver3 s2)
   added: (at driver3 p6-2)
   changed: (walked) from 567 to 627
   goals met: 16 of 17
98. (walk driver3 p6-2 s6)
   deleted: (at driver3 p6-2)
   added: (at driver3 s6)
   changed: (walked) from 627 to 667
   goals met: 16 of 17
99. (board-truck driver3 truck2 s6)
   deleted: (at driver3 s6) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 16 of 17
100. (drive-truck truck2 s6 s4 driver3)
   deleted: (at truck2 s6)
   added: (at truck2 s4)
   changed: (driven) from 1747 to 1793
   goals met: 17 of 17
